# HasLeader Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..HasLeader Property
Dimension Class See Also
---
True if dimension has leader, false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public bool HasLeader { get; set; }
```

Visual Basic
---
```text
Public Property HasLeader As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HasLeader {
	bool get ();
	void set (bool value);
}
```

# See Also
Dimension Class
Autodesk.Revit.DB Namespace